## Clase 12

### Cargo Paquetes Iniciales

In [8]:
import pandas as pd
import sqlite3

### Leer Info de una Base de Datos

In [9]:
#Me conecto a la Base de Datos
conn = sqlite3.connect('local\database\stock1.db')

OperationalError: unable to open database file

In [4]:
#¿Como ver las tablas de una BD?
tables = pd.read_sql_query("SELECT name FROM sqlite_master WHERE type='table'", conn)
tables.head()

    name
0   main
1  main2

In [5]:
#¿Como ver las tabla de compra_ventas?
main_table = pd.read_sql_query("SELECT * FROM main", conn)
main_table.head()

,index,Date,Open,High,Low,Close,Adj Close,Volume,Empresa
0,0,2023-01-03,130.279999,130.899994,124.169998,125.070000,124.879326,112117500,Apple
1,1,2023-01-04,126.889999,128.660004,125.080002,126.360001,126.167366,89113600,Apple
2,2,2023-01-05,127.129997,127.769997,124.760002,125.019997,124.829399,80962700,Apple
3,3,2023-01-06,126.010002,130.289993,124.889999,129.619995,129.422394,87754700,Apple
4,4,2023-01-09,130.470001,133.410004,129.889999,130.149994,129.951584,70790800,Apple

In [34]:
conn.close()